pgbenchresultadogoogle.txt
# pgbench -t 100 -c 5 -S  bdpgbench -U postgres -n  >> resultado.txt

transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 5
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 500/500
latency average: 0.762 ms
tps = 6564.264146 (including connections establishing)
tps = 6749.132062 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 5
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 500/500
latency average: 0.736 ms
tps = 6794.770744 (including connections establishing)
tps = 6989.233784 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 5
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 500/500
latency average: 0.752 ms
tps = 6646.108039 (including connections establishing)
tps = 6835.157865 (excluding connections establishing)
---------------------------------------
# pgbench -t 100 -c 10 -S  bdpgbench -U postgres -n  >> resultado.txt

transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average: 1.567 ms
tps = 6380.114459 (including connections establishing)
tps = 6473.895634 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average: 1.628 ms
tps = 6144.204479 (including connections establishing)
tps = 6221.865502 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average: 1.575 ms
tps = 6350.940257 (including connections establishing)
tps = 6433.263575 (excluding connections establishing)
--------------------------------------
# pgbench -t 100 -c 20 -S  bdpgbench -U postgres -n  >> resultado.txt

transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 20
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 2000/2000
latency average: 3.669 ms
tps = 5451.195447 (including connections establishing)
tps = 5480.589465 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 20
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 2000/2000
latency average: 3.572 ms
tps = 5599.637144 (including connections establishing)
tps = 5629.223325 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 20
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 2000/2000
latency average: 3.706 ms
tps = 5396.493898 (including connections establishing)
tps = 5423.063339 (excluding connections establishing)
-------------------------------------
# pgbench -t 100 -c 40 -S  bdpgbench -U postgres -n  >> resultado.txt

transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 40
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 4000/4000
latency average: 8.025 ms
tps = 4984.585170 (including connections establishing)
tps = 4997.326899 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 40
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 4000/4000
latency average: 8.035 ms
tps = 4978.195504 (including connections establishing)
tps = 4988.974522 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 40
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 4000/4000
latency average: 8.170 ms
tps = 4895.876937 (including connections establishing)
tps = 4907.388681 (excluding connections establishing)
--------------------------------------------
# pgbench -t 100 -c 80 -S  bdpgbench -U postgres -n  >> resultado.txt

transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 80
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 8000/8000
latency average: 17.615 ms
tps = 4541.552939 (including connections establishing)
tps = 4547.814176 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 80
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 8000/8000
latency average: 17.313 ms
tps = 4620.701087 (including connections establishing)
tps = 4625.559579 (excluding connections establishing)
transaction type: SELECT only
scaling factor: 10
query mode: simple
number of clients: 80
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 8000/8000
latency average: 17.579 ms
tps = 4550.905289 (including connections establishing)
tps = 4555.537360 (excluding connections establishing)